**Data Manipulation and Analysis with Pandas**

Data manipulation and analysis are key tasks in any data science or data analysis project. Pandas provides a wide range of functions for data manipulation and analysis, making it easier to clean, transform and extract insights from data. In this lesson, we will cover various data manipulation and analysis tecniques using Pandas.

In [29]:
import pandas as pd

In [30]:
salesData=pd.read_csv("salesData.csv")

#Fetch the first 5 rows
salesData.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [3]:
#Fetch the last 5 rows
salesData.tail()

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [4]:
# Describe the DataFrame
salesData.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [6]:
#Verify the types of the data
salesData.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [7]:
#Handling missing values
salesData.isnull() # Where is true, we have a missing value

     Date  Category  Value  Product  Sales  Region
0   False     False  False    False  False   False
1   False     False  False    False  False   False
2   False     False  False    False  False   False
3   False     False  False    False  False   False
4   False     False  False    False  False   False
5   False     False  False    False  False   False
6   False     False  False    False  False   False
7   False     False  False    False  False   False
8   False     False  False    False  False   False
9   False     False  False    False  False   False
10  False     False  False    False  False   False
11  False     False  False    False   True   False
12  False     False  False    False  False   False
13  False     False  False    False  False   False
14  False     False  False    False  False   False
15  False     False   True    False  False   False
16  False     False  False    False  False   False
17  False     False   True    False  False   False
18  False     False  False    False  False   False
19  False     False  False    False  False   False
20  False     False  False    False  False   False
21  False     False  False    False  False   False
22  False     False  False    False  False   False
23  False     False  False    False  False   False
24  False     False  False    False  False   False
25  False     False  False    False  False   False
26  False     False  False    False  False   False
27  False     False  False    False  False   False
28  False     False   True    False  False   False
29  False     False  False    False  False   False
30  False     False  False    False  False   False
31  False     False  False    False  False   False
32  False     False  False    False  False   False
33  False     False  False    False   True   False
34  False     False  False    False  False   False
35  False     False  False    False   True   False
36  False     False  False    False  False   False
37  False     False  False    False   True   False
38  False     False  False    False  False   False
39  False     False  False    False  False   False
40  False     False  False    False  False   False
41  False     False  False    False  False   False
42  False     False  False    False  False   False
43  False     False  False    False  False   False
44  False     False  False    False  False   False
45  False     False  False    False  False   False
46  False     False  False    False  False   False
47  False     False  False    False  False   False
48  False     False  False    False  False   False
49  False     False  False    False  False   False

In [19]:
# See the categories where we have a missing value
salesData.isnull().any()

Date        False
Category    False
Value        True
Product     False
Sales        True
Region      False
dtype: bool

In [20]:
#Sum all null values in a category

salesData.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [ ]:
#Fill missing values

#1. Replace the NaN with zero(0)

dataFrameFilled=salesData.fillna(0)
dataFrameFilled.isnull().sum()

Date        0
Category    0
Value       0
Product     0
Sales       0
Region      0
dtype: int64

In [31]:
#Filling missing values with the mean of the column
#Sales column
salesData["SalesFillNaN"]=salesData["Sales"].fillna(salesData["Sales"].mean())
salesData

          Date Category  Value   Product  Sales Region  SalesFillNaN
0   2023-01-01        A   28.0  Product1  754.0   East    754.000000
1   2023-01-02        B   39.0  Product3  110.0  North    110.000000
2   2023-01-03        C   32.0  Product2  398.0   East    398.000000
3   2023-01-04        B    8.0  Product1  522.0   East    522.000000
4   2023-01-05        B   26.0  Product3  869.0  North    869.000000
5   2023-01-06        B   54.0  Product3  192.0   West    192.000000
6   2023-01-07        A   16.0  Product1  936.0   East    936.000000
7   2023-01-08        C   89.0  Product1  488.0   West    488.000000
8   2023-01-09        C   37.0  Product3  772.0   West    772.000000
9   2023-01-10        A   22.0  Product2  834.0   West    834.000000
10  2023-01-11        B    7.0  Product1  842.0  North    842.000000
11  2023-01-12        B   60.0  Product2    NaN   West    557.130435
12  2023-01-13        A   70.0  Product3  628.0  South    628.000000
13  2023-01-14        A   69.0  Product1  423.0   East    423.000000
14  2023-01-15        A   47.0  Product2  893.0   West    893.000000
15  2023-01-16        C    NaN  Product1  895.0  North    895.000000
16  2023-01-17        C   93.0  Product2  511.0  South    511.000000
17  2023-01-18        C    NaN  Product1  108.0   West    108.000000
18  2023-01-19        A   31.0  Product2  578.0   West    578.000000
19  2023-01-20        A   59.0  Product1  736.0   East    736.000000
20  2023-01-21        C   82.0  Product3  606.0  South    606.000000
21  2023-01-22        C   37.0  Product2  992.0  South    992.000000
22  2023-01-23        B   62.0  Product3  942.0  North    942.000000
23  2023-01-24        C   92.0  Product2  342.0   West    342.000000
24  2023-01-25        A   24.0  Product2  458.0   East    458.000000
25  2023-01-26        C   95.0  Product1  584.0   West    584.000000
26  2023-01-27        C   71.0  Product2  619.0  North    619.000000
27  2023-01-28        C   56.0  Product2  224.0  North    224.000000
28  2023-01-29        B    NaN  Product3  617.0  North    617.000000
29  2023-01-30        C   51.0  Product2  737.0  South    737.000000
30  2023-01-31        B   50.0  Product3  735.0   West    735.000000
31  2023-02-01        A   17.0  Product2  189.0   West    189.000000
32  2023-02-02        B   63.0  Product3  338.0  South    338.000000
33  2023-02-03        C   27.0  Product3    NaN   East    557.130435
34  2023-02-04        C   70.0  Product3  669.0   West    669.000000
35  2023-02-05        B   60.0  Product2    NaN   West    557.130435
36  2023-02-06        C   36.0  Product3  177.0   East    177.000000
37  2023-02-07        C    2.0  Product1    NaN  North    557.130435
38  2023-02-08        C   94.0  Product1  408.0  South    408.000000
39  2023-02-09        A   62.0  Product1  155.0   West    155.000000
40  2023-02-10        B   15.0  Product1  578.0   East    578.000000
41  2023-02-11        C   97.0  Product1  256.0   East    256.000000
42  2023-02-12        A   93.0  Product3  164.0   West    164.000000
43  2023-02-13        A   43.0  Product3  949.0   East    949.000000
44  2023-02-14        A   96.0  Product3  830.0   East    830.000000
45  2023-02-15        B   99.0  Product2  599.0   West    599.000000
46  2023-02-16        B    6.0  Product1  938.0  South    938.000000
47  2023-02-17        B   69.0  Product3  143.0   West    143.000000
48  2023-02-18        C   65.0  Product3  182.0  North    182.000000
49  2023-02-19        C   11.0  Product3  708.0  North    708.000000

In [32]:
#Value column
salesData["ValueFillNaN"]=salesData["Value"].fillna(salesData["Value"].mean())
salesData

,Date,Category,Value,Product,Sales,Region,SalesFillNaN,ValueFillNaN
0,2023-01-01,A,28.0,Product1,754.0,East,754.000000,28.000000
1,2023-01-02,B,39.0,Product3,110.0,North,110.000000,39.000000
2,2023-01-03,C,32.0,Product2,398.0,East,398.000000,32.000000
3,2023-01-04,B,8.0,Product1,522.0,East,522.000000,8.000000
4,2023-01-05,B,26.0,Product3,869.0,North,869.000000,26.000000
5,2023-01-06,B,54.0,Product3,192.0,West,192.000000,54.000000
6,2023-01-07,A,16.0,Product1,936.0,East,936.000000,16.000000
7,2023-01-08,C,89.0,Product1,488.0,West,488.000000,89.000000
8,2023-01-09,C,37.0,Product3,772.0,West,772.000000,37.000000
9,2023-01-10,A,22.0,Product2,834.0,West,834.000000,22.000000
10,2023-01-11,B,7.0,Product1,842.0,North,842.000000,7.000000
11,2023-01-12,B,60.0,Product2,NaN,West,557.130435,60.000000
12,2023-01-13,A,70.0,Product3,628.0,South,628.000000,70.000000
13,2023-01-14,A,69.0,Product1,423.0,East,423.000000,69.000000
14,2023-01-15,A,47.0,Product2,893.0,West,893.000000,47.000000
15,2023-01-16,C,NaN,Product1,895.0,North,895.000000,51.744681
16,2023-01-17,C,93.0,Product2,511.0,South,511.000000,93.000000
17,2023-01-18,C,NaN,Product1,108.0,West,108.000000,51.744681
18,2023-01-19,A,31.0,Product2,578.0,West,578.000000,31.000000
19,2023-01-20,A,59.0,Product1,736.0,East,736.000000,59.000000
20,2023-01-21,C,82.0,Product3,606.0,South,606.000000,82.000000
21,2023-01-22,C,37.0,Product2,992.0,South,992.000000,37.000000
22,2023-01-23,B,62.0,Product3,942.0,North,942.000000,62.000000
23,2023-01-24,C,92.0,Product2,342.0,West,342.000000,92.000000
24,2023-01-25,A,24.0,Product2,458.0,East,458.000000,24.000000
25,2023-01-26,C,95.0,Product1,584.0,West,584.000000,95.000000
26,2023-01-27,C,71.0,Product2,619.0,North,619.000000,71.000000
27,2023-01-28,C,56.0,Product2,224.0,North,224.000000,56.000000
28,2023-01-29,B,NaN,Product3,617.0,North,617.000000,51.744681
29,2023-01-30,C,51.0,Product2,737.0,South,737.000000,51.000000
30,2023-01-31,B,50.0,Product3,735.0,West,735.000000,50.000000
31,2023-02-01,A,17.0,Product2,189.0,West,189.000000,17.000000
32,2023-02-02,B,63.0,Product3,338.0,South,338.000000,63.000000
33,2023-02-03,C,27.0,Product3,NaN,East,557.130435,27.000000
34,2023-02-04,C,70.0,Product3,669.0,West,669.000000,70.000000
35,2023-02-05,B,60.0,Product2,NaN,West,557.130435,60.000000
36,2023-02-06,C,36.0,Product3,177.0,East,177.000000,36.000000
37,2023-02-07,C,2.0,Product1,NaN,North,557.130435,2.000000
38,2023-02-08,C,94.0,Product1,408.0,South,408.000000,94.000000
39,2023-02-09,A,62.0,Product1,155.0,West,155.000000,62.000000
40,2023-02-10,B,15.0,Product1,578.0,East,578.000000,15.000000
41,2023-02-11,C,97.0,Product1,256.0,East,256.000000,97.000000
42,2023-02-12,A,93.0,Product3,164.0,West,164.000000,93.000000
43,2023-02-13,A,43.0,Product3,949.0,East,949.000000,43.000000
44,2023-02-14,A,96.0,Product3,830.0,East,830.000000,96.000000
45,2023-02-15,B,99.0,Product2,599.0,West,599.000000,99.000000
46,2023-02-16,B,6.0,Product1,938.0,South,938.000000,6.000000
47,2023-02-17,B,69.0,Product3,143.0,West,143.000000,69.000000
48,2023-02-18,C,65.0,Product3,182.0,North,182.000000,65.000000
49,2023-02-19,C,11.0,Product3,708.0,North,708.000000,11.000000

Renaming a column

In [35]:
def renameColumn(dataFrame,dictionaryNames):
    """"Renames the column of a DataFrame

    Args:
        dataFrame: Name of the dataframe
        dictionaryNames: A dictionary of columns, where the current name is the key and the new name is the value. 

    Returns:
    DataFrame with the column renamed
    """
    try:
        dataFrame=dataFrame.rename(columns=dictionaryNames) # Columns receives a dictionary
    except TypeError as ex:
        print(ex)

    except Exception as ex:
        print(ex)
   
    else:        
        return dataFrame



salesData=renameColumn(salesData,{"Date":"Sales Date"})
salesData.head()

,Sales Date,Category,Value,Product,Sales,Region,SalesFillNaN,ValueFillNaN
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28.0
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39.0
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32.0
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,8.0
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,26.0

Changing data types

In [40]:
salesData.dtypes
type(salesData["ValueFillNaN"][0]) # Object==String
print(salesData["ValueFillNaN"][17])

51.744680851063826

In [ ]:
#Drop the columns value and sales
salesData.drop("Value",axis=1,inplace=True)
salesData.drop("Sales", axis=1, inplace=True)

In [46]:
salesData.dtypes

Sales Date       object
Category         object
Product          object
Region           object
SalesFillNaN    float64
ValueFillNaN    float64
dtype: object

**Conversao de String para Data**


Tabela essencial de formatos mais usados

Data:

| Cdigo | Significado     | Exemplo  |
| ------ | --------------- | -------- |
| `%d`   | Dia             | 04       |
| `%m`   | Ms numrico    | 12       |
| `%b`   | Ms abreviado   | Dec      |
| `%B`   | Ms completo    | December |
| `%y`   | Ano (2 dgitos) | 24       |
| `%Y`   | Ano (4 dgitos) | 2024     |



Hora:

| Cdigo | Significado | Exemplo |
| ------ | ----------- | ------- |
| `%H`   | Hora (24h)  | 22      |
| `%I`   | Hora (12h)  | 10      |
| `%M`   | Minutos     | 07      |
| `%S`   | Segundos    | 45      |
| `%p`   | AM / PM     | AM      |

In [ ]:
#Converts the Sales Date into Date type

#How to convert String to DateTime?

#1. Convert String to Datetime using Datetime.Strptime()

import datetime

def convertStringToDate(stringDate,formatDate):
    """"Converts a string into datetime format
    Args:
        stringDate: Date in string format
        formatDate: The format of the date
    
    Returns:
        Datetime object
    """
    

    try:
        dateTime=datetime.datetime.strptime(stringDate,formatDate)

    except ValueError as ex:
        print(ex)
    except TypeError as ex:
        print(ex)
    
    else:
        return dateTime.date() #Returns only the date ignoring the time.

    

strDate="Dec 4 2024 10:07AM"
format="%b %d %Y %I:%M%p"
date=convertStringToDate(strDate,format)
print(date)
print(date.year)

print("")


dateString="2023-01-01"
format2="%Y-%m-%d"
date2=convertStringToDate(dateString,format2)
print(date2)

2024-12-04
2024

2023-01-01

Applying a Function to Each Column Using Two Arguments


# Define a function to add two numbers
def addData(x, y):
    return x + y

# Apply the function to each column, adding 1 to each value
new_df = df.apply(addData, args=[1])

In [78]:
salesData["Sales Date"]=salesData["Sales Date"].apply(convertStringToDate,args=[format2])

salesData.head()
print(salesData.dtypes,"\n")

print("Year: ",salesData["Sales Date"][0].year)
type(salesData["Sales Date"][0])

Sales Date       object
Category         object
Product          object
Region           object
SalesFillNaN    float64
ValueFillNaN    float64
dtype: object

Year:  2023

datetime.date

**Data aggregation and grouping**

#Data Grouping (agrupamento):

 dividir os dados em grupos, com base em uma ou mais colunas.

#Data Aggregation (agregao):

 resumir os dados de cada grupo, usando funes como:

sum()  soma

mean()  mdia

count()  contagem

min() / max()

std()  desvio padro

In [122]:
#Group by one category (Product)
groupbyProduct=salesData.groupby("Product")["ValueFillNaN"].count()
groupbyProduct

Product
Product1    16
Product2    15
Product3    19
Name: ValueFillNaN, dtype: int64

In [123]:
#Group by two or more categories (Product, Region)
groupbyProductAndRegion=salesData.groupby(["Product","Region"])["ValueFillNaN"].sum()
groupbyProductAndRegion

Product   Region
Product1  East      292.000000
          North      60.744681
          South     100.000000
          West      297.744681
Product2  East       56.000000
          North     127.000000
          South     181.000000
          West      428.000000
Product3  East      202.000000
          North     254.744681
          South     215.000000
          West      373.000000
Name: ValueFillNaN, dtype: float64

In [105]:
#Aggregate multiple functions
groupAggregation=salesData.groupby("Region")["ValueFillNaN"].agg(["mean","sum","count","min","max"])
groupAggregation

             mean          sum  count   min   max
Region
East    42.307692   550.000000     13   8.0  97.0
North   40.226306   442.489362     11   2.0  71.0
South   62.000000   496.000000      8   6.0  94.0
West    61.041371  1098.744681     18  17.0  99.0

**Merging and joining DataFrames**

Merging / Joining significa combinar dois ou mais DataFrames com base em colunas ou ndices em comum, de forma semelhante ao que se faz em SQL (JOIN).

In [115]:
#Create sample DataFrames
dictionary1={"key":["A","B","C"], "Value":[1,2,3]}
dictionary2={"key":["A","B","D"], "Value":[4,5,6]}
df1=pd.DataFrame(dictionary1)
df2=pd.DataFrame(dictionary2)

df1

  key  Value
0   A      1
1   B      2
2   C      3

In [117]:
df2

  key  Value
0   A      4
1   B      5
2   D      6

In [ ]:
#Merge DataFrames on the "key" 

#Inner join (interseco)
#Apenas chaves comuns
mergedDataFrameInner=pd.merge(df1,df2,on="key",how="inner")
mergedDataFrameInner

  key  Value_x  Value_y
0   A        1        4
1   B        2        5

In [ ]:
#Left (prioridade ao DataFrame da esquerda)
#Mantm todos as chaves do dataFrame a esquerda
#Valores ausentes  NaN
mergedDataFrameLeft=pd.merge(df1,df2,on="key", how="left")
mergedDataFrameLeft

  key  Value_x  Value_y
0   A        1      4.0
1   B        2      5.0
2   C        3      NaN

In [121]:
#Right (prioridade ao DataFrame da direita)
#Mantm todos as chaves do dataFrame a direita
#Valores ausentes  NaN

mergedDataFrameRight=pd.merge(df1,df2,on="key", how="right")
mergedDataFrameRight

  key  Value_x  Value_y
0   A      1.0        4
1   B      2.0        5
2   D      NaN        6

In [ ]:
#Outer join (unio total)
#Mantm todos os dados
#Onde no h correspondncia  NaN

mergedDataFrameOuter=pd.merge(df1,df2,on="key",how="outer")
mergedDataFrameOuter

  key  Value_x  Value_y
0   A      1.0      4.0
1   B      2.0      5.0
2   C      3.0      NaN
3   D      NaN      6.0